# CompoundStructureLayer Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructureLayer Constructor
CompoundStructureLayer Class See Also
---
Creates a compound structure layer using default settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CompoundStructureLayer()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
CompoundStructureLayer()
```

# Remarks
Note that the combination of the default values does not create a completely valid CompoundStructureLayer. You should change the necessary values before adding to a CompoundStructure.
# See Also
CompoundStructureLayer Class
CompoundStructureLayer Overload
Autodesk.Revit.DB Namespace